fazibear/pix/pix_esp8266/firmware/src/esp.h
#pragma once

#include "platform.h"
#include <Arduino.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <NTPClient.h>
#include <WiFiClient.h>
#include <WiFiClientSecureBearSSL.h>
#include <WifiUdp.h>
#include <Wire.h>
#include <bitset>
#include <string>

#define A1 0
#define A2 4
#define A3 5

#define OE 14
#define LE 12
#define SDI 13
#define CLK 15

#define LINES 8
// #define PER_LINE 12
#define BITS_PER_LINE 16 * 2 * 3

class Esp : public Platform {
public:
  void init();
  void clear();
  void set_dot(uint8 x, uint8 y, bool r, bool g, bool b);
  void draw();

  virtual inline std::array<uint8_t, 3> get_time();
  std::string fetch(std::string);

private:
  void set_line(uint8 row);
  std::bitset<BITS_PER_LINE> matrix[LINES] = {{0}};
  std::string time_server = "time.nist.gov";
  WiFiUDP *udp;
  NTPClient *time;
};
